{
    "starting_room": "tech_room",
    "global_state": {
        "power_status": "normal",
        "alarm_active": false,
        "day_count": 1
    },
    "rooms": [
        {
            "id": "tech_room",
            "name": "Teknika Chambro 5B",
            "description": "Vu esas en Teknika Chambro 5B, vua primara laborloko. La muri esas kovrita per kontrolpaneli e statuso-ekrani, montranta diversa mezuri de la instalaji sistemi. Granda labortablo esas en la centro di la chambro, kovrita kun utensili ed equipajo. La aero bruisas per la sono di mashini.",
            "type": "technical",
            "items": [
                {
                    "id": "diagnostic_tool",
                    "name": "Diagnoza Utensilo",
                    "description": "Tenebla aparato uzata por diagnozar teknikala problemi en la instalaji sistemi. Olu mikra ekrano montras diversa mezuri e diagnoza informo.",
                    "takeable": true,
                    "usable": true,
                    "type": "tool",
                    "use_effects": [
                        {
                            "room_type": "technical",
                            "message": "Vu startigas la diagnoza utensilo e sondas la cirkondanta sistemi. La lekturi indikas normala funcionado kun kelka mikra fluktuadi en la energio-niveli.",
                            "effects": []
                        },
                        {
                            "room_type": "corridor",
                            "message": "Vu startigas la diagnoza utensilo e sondas la areo. La lekturi montras kelka nekutima elektromagnetala aktiveso en la muri.",
                            "effects": []
                        }
                    ]
                },
                {
                    "id": "nutrition_bar",
                    "name": "Nutrivo-Stango",
                    "description": "Standard-donita nutrivo-stango furnisata al la laboristi di la instalajo. Ol ne aspektas tre apetiziga, ma ol devus furnizar sat energio por kontinuar.",
                    "takeable": true,
                    "usable": true,
                    "consumable": true,
                    "type": "food",
                    "nutrition": 30
                }
            ],
            "furniture": [
                {
                    "id": "workbench",
                    "name": "Labortablo",
                    "description": "Robusta metala labortablo kovrita kun diversa utensili e elektronikala komponenti. Plura projekti semblas esar en diversa stadi di kompletigeso.",
                    "interaction": {
                        "message": "Vu sortigas la objekti sur la labortablo, trovante precipue rezerva peci e mi-finita reparuri.",
                        "effects": []
                    }
                },
                {
                    "id": "control_panel",
                    "name": "Kontrolpanelo",
                    "description": "Mur-muntita kontrolpanelo kun multa butoni, klefili, e statuso-indikatili. Ol semblas monitorigar la energio-distributo por ica seciono di la instalajo.",
                    "interaction": {
                        "message": "Vu kontrolas la lekturi di la kontrolpanelo. Omno semblas funcionar en normala parametri, quankam esas mikra energio-fluktuado en Sektoro 7.",
                        "effects": [
                            {
                                "type": "set_global",
                                "key": "noticed_fluctuation",
                                "value": true
                            }
                        ]
                    }
                }
            ],
            "exits": {
                "north": "corridor_1"
            },
            "events": [
                {
                    "probability": 0.2,
                    "message": "La lumo flagras kurta-tempe, pose retroiras a normala.",
                    "effects": []
                }
            ]
        },
        {
            "id": "corridor_1",
            "name": "Chefa Koridoro",
            "description": "Vu esas en la chefa koridoro konektanta la teknikala arei kun la resto di la instalajo. La koridoro extensas esto e westo, kun glata metala muri piktita en praktikala griza. La superkapala lumigado emisas sterila blanka brilo, e sporadika statuso-paneli montras instalaj-informo.",
            "type": "corridor",
            "items": [
                {
                    "id": "facility_map",
                    "name": "Instalaj-Mapo",
                    "description": "Digitala tableto montranta mapo di la instalajo. Ol montras la esquiso di la teknikala sektoro e adjacanta arei.",
                    "takeable": true,
                    "usable": true,
                    "type": "tool",
                    "use_message": "Vu studias la instalaj-mapo, aquirante plu bona kompreno di la esquiso. La teknikala sektoro konektas al la vivala quarteri verso esto e la centrala hubo verso westo."
                }
            ],
            "furniture": [
                {
                    "id": "status_panel",
                    "name": "Statuso-Panelo",
                    "description": "Mur-muntita statuso-panelo montranta informo pri la instalaji sistemi. Ol montras energio-niveli, ambiente kondicioni, e sekureso-statuso.",
                    "interaction": {
                        "message": "La statuso-panelo montras ke omna sistemi funcionas normale, quankam esas notifikado pri planizata mantenado en la ventilado-sistemo morge.",
                        "effects": []
                    }
                }
            ],
            "exits": {
                "south": "tech_room",
                "east": "living_quarters",
                "west": "central_hub"
            },
            "events": []
        },
        {
            "id": "living_quarters",
            "name": "Vivala Quarteri",
            "description": "Vu eniras la vivala quarteri seciono. Ica areo kontenas mikra personala chambri por la laboristi di la instalajo. La ambiente esas plu komfortoza hike, kun plu mola lumigado e plu personalizita dekoro. Komuna areo havas sidilaro e bazala koqueyo-facilitaji.",
            "type": "residential",
            "items": [
                {
                    "id": "water_bottle",
                    "name": "Aquo-Botelo",
                    "description": "Re-uzebla aquo-botelo facita ek rezistiva plastiko. Ol es cirkume mez-plena de klara aquo.",
                    "takeable": true,
                    "usable": true,
                    "consumable": false,
                    "type": "drink",
                    "hydration": 40
                }
            ],
            "furniture": [
                {
                    "id": "bed",
                    "name": "Lito",
                    "description": "Simpla ma komfortoza lito kun freshe blanka linaji. Ol aspektas invitanta pos longa laborturno.",
                    "interaction": {
                        "message": "Vu prenas kurta repozo sur la lito. Esas bona sentar relaxata por momento.",
                        "effects": [
                            {
                                "type": "schedule_event",
                                "turns": 1,
                                "message": "Vu sentas refreskigita pos vua repozo.",
                                "effects": [
                                    {
                                        "type": "player_effect",
                                        "effect": "rest",
                                        "value": 30
                                    }
                                ]
                            }
                        ]
                    }
                },
                {
                    "id": "personal_locker",
                    "name": "Personala Shranko",
                    "description": "Metala shranko asignita a laboristi di la instalajo por konservar personala apartanataji. Ol havas klav-protektilo.",
                    "interaction": {
                        "message": "Vu entresigas vua aceso-kodo e apertas la shranko. Interne, vu trovas kelka personala objekti e mikra kayero kun vua skriburo.",
                        "effects": [
                            {
                                "type": "add_item",
                                "target": "room",
                                "item": {
                                    "id": "notebook",
                                    "name": "Personala Kayero",
                                    "description": "Vua personala kayero kontinanta noti pri vua laboro e kodiana vivo en la instalajo. Esas kelka skribita pensi pri recenta energio-fluktuadi qui semblas trubliganta.",
                                    "takeable": true,
                                    "usable": true,
                                    "type": "tool",
                                    "use_message": "Vu folias tra vua kayero, lektante vua noti pri la instalajo. Vu dokumentabis kelka nekutima energio-fluktuadi qui komencis cirkume un semano ante nun. La lasta enskribo mencionas ke vu planizis facar plusa diagnozozo hodie."
                                }
                            }
                        ]
                    }
                }
            ],
            "exits": {
                "west": "corridor_1"
            },
            "events": [
                {
                    "probability": 0.1,
                    "message": "Vu audas quieta konversado de un del altra chambri.",
                    "effects": []
                }
            ]
        },
        {
            "id": "central_hub",
            "name": "Centrala Hubo",
            "description": "Vu standas en la centrala hubo di la instalajo, granda cirkla chambro kun multa koridori branchizanta en diversa direcioni. La plafono extensas alte supre, kun centrala suprala fenestro permisante vido di la rokoza kaverno supere. Plura laboristi movas cirkum, irante de un seciono ad altra.",
            "type": "hub",
            "items": [],
            "furniture": [
                {
                    "id": "central_terminal",
                    "name": "Centrala Terminalo",
                    "description": "Granda terminalo en la centro di la hubo, montranta instalaj-larga statuso-informo e anunci. Plura personi esas kunvenanta cirkum ol, diskutante ulo.",
                    "interaction": {
                        "message": "Dum vu proximeskas la terminalo, vu remarkigas grupo di seniora teknikisti diskutante ulo kun trublita expresi. Un de ili, Kaliel, remarkigas vu e manusignalas vu super.\n\n'Ha, bona tempo! Ni vidas kelka nekutima lekturi de la Crucis-Mashino sistemi. Nulo kritikala ankore, ma ni monitorigas ol. Vu probable devus facar kompleta diagnozozo en vua sektoro kande vu retroiras.'",
                        "effects": [
                            {
                                "type": "set_global",
                                "key": "met_kaliel",
                                "value": true
                            },
                            {
                                "type": "schedule_event",
                                "turns": 3,
                                "message": "Vua komunikilo bipas kun mesajo de Kaliel: 'Ita fluktuadi divenas plu mala. Ka vu povas retrovenar al la hubo kande vu havas oportunajo?'",
                                "effects": []
                            }
                        ]
                    }
                },
                {
                    "id": "announcement_board",
                    "name": "Anunca Panelo",
                    "description": "Digitala panelo montranta instalaj-anunci, labor-horari, e altra importanta informo por laboristi.",
                    "interaction": {
                        "message": "Vu kontrolas la anunca panelo. Inter la rutinala avizi, esas nova anunco pri augmentita sekureso-mezuri cirkum la Crucis-Mashino projekto. Aceso a certa arei esas nun limitizita a seniora personaro nur.",
                        "effects": []
                    }
                }
            ],
            "exits": {
                "east": "corridor_1",
                "north": "research_wing"
            },
            "events": [
                {
                    "probability": 0.3,
                    "message": "Grupo de esploradisti pasas preter, okupata en intensa diskuto pri ulo nomizita 'kontenado protokoli.'",
                    "effects": []
                }
            ]
        },
        {
            "id": "research_wing",
            "name": "Exploro-Flugilo Enireyo",
            "description": "Vu standas che la enireyo a la exploro-flugilo. Pezoza sekureso-pordo blokas plusa progreso, kun sondilo por autorizal atesti. La muri hike esas diferanta - renforcita e lineizita per averto-signi pri autorizita personaro nur.",
            "type": "security",
            "items": [],
            "furniture": [
                {
                    "id": "security_scanner",
                    "name": "Sekureso-Sondilo",
                    "description": "Biometrika sekureso-sondilo qua kontrolas aceso a la exploro-flugilo. Ol bezonas propra autorizal atesti por permesar eniro.",
                    "interaction": {
                        "message": "Vu pozas vua manuo sur la sondilo, ma ol flagras reda e montras 'ACESO REFUZITA - NESUFICONATA AUTENTIKESO-NIVELO.' Vu bezonas plu alta sekureso-atesti por entrar ica areo.",
                        "effects": []
                    }
                },
                {
                    "id": "warning_sign",
                    "name": "Averto-Signo",
                    "description": "Granda signo kun grosega reda literi: 'LIMITIZITA AREO - CRUCIS-MASHINO PROJEKTO - AUTORIZITA PERSONARO NUR'",
                    "interaction": {
                        "message": "Vu lektas la averto-signo atenteme. Sub la chefa averto, plu mikra texto dicas: 'Violaco di sekureso-protokoli rezultos en senprokrasta finigio di employo e posibla kriminala akuzi. Omna aktivesi en ica areo esas monitoragata.'",
                        "effects": []
                    }
                }
            ],
            "exits": {
                "south": "central_hub"
            },
            "events": [
                {
                    "probability": 0.2,
                    "message": "La sekureso-pordo al la exploro-flugilo apertas kurtatempo dum ulu ekiresas. Vu kaptas lum-virado di vasta chambro kun kompleksa mashini ante ke la pordo sigelesas itere.",
                    "effects": []
                }
            ]
        }
    ],
    "passages": [],
    "items": []
} 